In [3]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [5]:
# 使用创建 Series

Series(data=[1,2,3])
Series(data=[1,2,3], index=['a','b','c']) # 现实索引

a    1
b    2
c    3
dtype: int64

In [8]:
# 使用 numpy 创建 Series
s = Series(data=np.random.randint(0,100,(4)), index=['a','b','c','d'])
s

a    75
b    60
c    73
d    68
dtype: int64

In [14]:
s[[1,3]]

b    60
d    68
dtype: int64

In [13]:
s[0:3]

a    75
b    60
c    73
dtype: int64

In [16]:
s.values
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [19]:
#s.head(), tail() 查看前n个值和后n个值
s.head(2)
s.tail(2)

c    73
d    68
dtype: int64

In [20]:
# 去重
s = Series(data=[1,1,1,1,1,1,2,3,4,4,5,6,7])
s.unique()

array([1, 2, 3, 4, 5, 6, 7])

In [21]:
s1 = Series(data=[1,2,3], index=['a','b','c'])
s2 = Series(data=[1,2,3], index=['a','b','d'])
s = s1 + s2
s

a    2.0
b    4.0
c    NaN
d    NaN
dtype: float64

In [23]:
s.isnull()
s.notnull()

a     True
b     True
c    False
d    False
dtype: bool

In [26]:
s[[True, True, False, False]]
s[s.notnull()]

a    2.0
b    4.0
dtype: float64

In [27]:
s1.add(s2)

a    2.0
b    4.0
c    NaN
d    NaN
dtype: float64

In [28]:
arr = np.array([1,2,3])
type(arr)

numpy.ndarray

In [30]:
DataFrame(data=np.random.randint(0,100, size=(3,4)), index=['a','b','c'])

    0   1   2   3
a  79  52  90  83
b  42  81  54   4
c  29  67  16  52

In [55]:
dic = {
    '张三': [11,22,33,44],
    '李四': [45,66,77,88]
}
df_score = DataFrame(data=dic, index=['语文','数学','英语','理综'] )

In [41]:
df = DataFrame(data=np.random.randint(0,100, size=(3,4)), index=['a','b','c'], columns=['A','B','C','D'])
df

    A   B   C   D
a   4  47   4  49
b  42  82   8  76
c  56  37  92  30

In [43]:
# 获取前2列
df[['A','B']]

    A   B
a   4  47
b  42  82
c  56  37

In [46]:
# 获取前2行

df.iloc[[0,1]]
df.loc[['a','b']]

    A   B  C   D
a   4  47  4  49
b  42  82  8  76

In [47]:
df.loc['a','D']

49

In [48]:
df.loc[['a','b'],'D']

a    49
b    76
Name: D, dtype: int64

In [49]:
df

    A   B   C   D
a   4  47   4  49
b  42  82   8  76
c  56  37  92  30

In [51]:
# 切出前2行
df['a':'b']
df[0:2]

    A   B  C   D
a   4  47  4  49
b  42  82  8  76

In [53]:
# 切出前2列
df.loc[:,'A':'B']

    A   B
a   4  47
b  42  82
c  56  37

In [54]:
df + df

     A    B    C    D
a    8   94    8   98
b   84  164   16  152
c  112   74  184   60

In [61]:
df_score
qizhong = df_score
qimo = df_score

In [59]:
(qizhong + qimo) / 2

      张三    李四
语文  11.0  45.0
数学  22.0  66.0
英语  33.0  77.0
理综  44.0  88.0

In [65]:
qizhong.loc['数学','张三'] = 0
qizhong

    张三  李四
语文  11  45
数学   0  66
英语  33  77
理综  44  88

In [68]:
qizhong['李四'] += 100
qizhong

    张三   李四
语文  11  145
数学   0  166
英语  33  177
理综  44  188

In [70]:
qizhong += 10
qizhong

    张三   李四
语文  21  155
数学  10  176
英语  43  187
理综  54  198

In [4]:
import tushare as ts

In [7]:
df = ts.get_k_data(code='600519',  start='2000-01-01')
df.to_csv('./maotai.csv')

In [5]:
# df 的 date 作为行索引,将字符串转换为时间类型
df = pd.read_csv('./maotai.csv', index_col='date',  parse_dates=['date'])
# 删除df的某一列
df.drop(labels="Unnamed: 0", axis=1, inplace=True)

In [16]:
df.head(5)

             open  close   high    low     volume    code
date
2001-08-27  5.392  5.554  5.902  5.132  406318.00  600519
2001-08-28  5.467  5.759  5.781  5.407  129647.79  600519
2001-08-29  5.777  5.684  5.781  5.640   53252.75  600519
2001-08-30  5.668  5.796  5.860  5.624   48013.06  600519
2001-08-31  5.804  5.782  5.877  5.749   23231.48  600519

In [18]:
#验证行索引的类型
df.index[0]

Timestamp('2001-08-27 00:00:00')

In [10]:
# 输出该股票所有收盘比开盘上涨3%的日期
#（收盘-开盘）/开盘 > 0.03
(df['close']- df['open']) / df['open'] > 0.03

date
2001-08-27     True
2001-08-28     True
2001-08-29    False
2001-08-30    False
2001-08-31    False
              ...
2020-01-17    False
2020-01-20    False
2020-01-21    False
2020-01-22    False
2020-01-23    False
Length: 4394, dtype: bool

In [12]:
# 一旦遇到了一组布尔值，直接将布尔值作为源数据的行索引
df.loc[(df['close']- df['open']) / df['open'] > 0.03].index

DatetimeIndex(['2001-08-27', '2001-08-28', '2001-09-10', '2001-12-21',
               '2002-01-18', '2002-01-31', '2003-01-14', '2003-10-29',
               '2004-01-05', '2004-01-14',
               ...
               '2019-03-01', '2019-03-18', '2019-04-10', '2019-04-16',
               '2019-05-10', '2019-05-15', '2019-06-11', '2019-06-20',
               '2019-09-12', '2019-09-18'],
              dtype='datetime64[ns]', name='date', length=303, freq=None)

In [18]:
# 输出所有开盘比前日收盘跌幅超过2%的日期
# (开盘-前日收盘) / 前日收盘  < -0.02

(df['open'] - df['close'].shift(1)) / df['close'].shift(1) < -0.02
df.loc[(df['open'] - df['close'].shift(1)) / df['close'].shift(1) < -0.02].index

DatetimeIndex(['2001-09-12', '2002-06-26', '2002-12-13', '2004-07-01',
               '2004-10-29', '2006-08-21', '2006-08-23', '2007-01-25',
               '2007-02-01', '2007-02-06', '2007-03-19', '2007-05-21',
               '2007-05-30', '2007-06-05', '2007-07-27', '2007-09-05',
               '2007-09-10', '2008-03-13', '2008-03-17', '2008-03-25',
               '2008-03-27', '2008-04-22', '2008-04-23', '2008-04-29',
               '2008-05-13', '2008-06-10', '2008-06-13', '2008-06-24',
               '2008-06-27', '2008-08-11', '2008-08-19', '2008-09-23',
               '2008-10-10', '2008-10-15', '2008-10-16', '2008-10-20',
               '2008-10-23', '2008-10-27', '2008-11-06', '2008-11-12',
               '2008-11-20', '2008-11-21', '2008-12-02', '2009-02-27',
               '2009-03-25', '2009-08-13', '2010-04-26', '2010-04-30',
               '2011-08-05', '2012-03-27', '2012-08-10', '2012-11-22',
               '2012-12-04', '2012-12-24', '2013-01-16', '2013-01-25',
               '2013-09-02', '2014-04-25', '2015-01-19', '2015-05-25',
               '2015-07-03', '2015-07-08', '2015-07-13', '2015-08-24',
               '2015-09-02', '2015-09-15', '2017-11-17', '2018-02-06',
               '2018-02-09', '2018-03-23', '2018-03-28', '2018-07-11',
               '2018-10-11', '2018-10-24', '2018-10-25', '2018-10-29',
               '2018-10-30', '2019-05-06', '2019-05-08', '2019-10-16',
               '2020-01-02'],
              dtype='datetime64[ns]', name='date', freq=None)

In [13]:
df['close'].head(5)

date
2001-08-27    5.554
2001-08-28    5.759
2001-08-29    5.684
2001-08-30    5.796
2001-08-31    5.782
Name: close, dtype: float64

In [15]:
df['close'].shift(1).head(5)

date
2001-08-27      NaN
2001-08-28    5.554
2001-08-29    5.759
2001-08-30    5.684
2001-08-31    5.796
Name: close, dtype: float64

In [19]:
# 从2010.1.1 开始， 每月第一个交易日1手股票，每年最后一个交易日卖出所有股票，到今天位置，收益如何
new_df = df['2010-01-01': '2020-02-02']
new_df

                open     close      high       low    volume    code
date
2010-01-04   109.760   108.446   109.760   108.044  44304.88  600519
2010-01-05   109.116   108.127   109.441   107.846  31513.18  600519
2010-01-06   107.840   106.417   108.165   106.129  39889.03  600519
2010-01-07   106.417   104.477   106.691   103.302  48825.55  600519
2010-01-08   104.655   103.379   104.655   102.167  36702.09  600519
...              ...       ...       ...       ...       ...     ...
2020-01-17  1110.000  1107.500  1112.780  1101.010  23472.00  600519
2020-01-20  1111.860  1091.000  1111.860  1082.000  35391.00  600519
2020-01-21  1081.000  1075.300  1087.000  1072.300  32874.00  600519
2020-01-22  1070.000  1075.510  1084.000  1055.380  36200.00  600519
2020-01-23  1076.000  1052.800  1076.000  1037.000  53468.00  600519

[2441 rows x 6 columns]

In [23]:
# 将买股票对应的行数据找出
# 在 new_df 中将每个月的第一个交易日的行数据取出
# 将每一行中的open取出 

df_monthly = new_df.resample('M').first()
df_yearly = new_df.resample('A').last()[:-1]
df_yearly

                open     close      high       low   volume    code
date
2010-12-31   117.103   118.469   118.701   116.620  46084.0  600519
2011-12-31   138.039   138.468   139.600   136.105  29460.0  600519
2012-12-31   155.208   152.087   156.292   150.144  51914.0  600519
2013-12-31    93.188    96.480    97.179    92.061  57546.0  600519
2014-12-31   157.642   161.056   161.379   157.132  46269.0  600519
2015-12-31   207.487   207.458   208.704   207.106  19673.0  600519
2016-12-31   317.239   324.563   325.670   317.239  34687.0  600519
2017-12-31   707.948   687.725   716.329   681.918  76038.0  600519
2018-12-31   563.300   590.010   596.400   560.000  63678.0  600519
2019-12-31  1183.000  1183.000  1188.000  1176.510  22588.0  600519

In [25]:
# 买入股票花了多少钱
const_money = df_monthly['open'] .sum() * 100
const_money

3911706.1

In [26]:
df_yearly

                open     close      high       low   volume    code
date
2010-12-31   117.103   118.469   118.701   116.620  46084.0  600519
2011-12-31   138.039   138.468   139.600   136.105  29460.0  600519
2012-12-31   155.208   152.087   156.292   150.144  51914.0  600519
2013-12-31    93.188    96.480    97.179    92.061  57546.0  600519
2014-12-31   157.642   161.056   161.379   157.132  46269.0  600519
2015-12-31   207.487   207.458   208.704   207.106  19673.0  600519
2016-12-31   317.239   324.563   325.670   317.239  34687.0  600519
2017-12-31   707.948   687.725   716.329   681.918  76038.0  600519
2018-12-31   563.300   590.010   596.400   560.000  63678.0  600519
2019-12-31  1183.000  1183.000  1188.000  1176.510  22588.0  600519

In [27]:
# 卖出股票的钱
recv_money =  df_yearly['open'].sum() * 1200
recv_money

4368184.8

In [30]:
# 剩余的股票股价
new_df[-1:]['open'] * 900

date
2020-01-23    5336584.8
Name: open, dtype: float64

In [31]:
# 计算赚了还是赔了
new_df[-1:]['open'] * 900 + recv_money - const_money

date
2020-01-23    1424878.7
Name: open, dtype: float64